var R={
    ISTJ:{
        b : '플레인요거트버블티',
        w : '원칙과 기본을 지키는 당신에게는, 기본에 충실한 플레인요거트버블티!',
        e : '이런 타입은 사람들은 보통 규칙이나 기한을 정확하게 준수하며, 모든 일에 정직하게 행동합니다. 또한 집중력 강하고 매사에 철저하기 때문에 냉정하거나 신중하다는 말을 많이 듣습니다. 또한 모든 일에 책임감을 가지고 성실하게 수행해 나가는 편입니다.',
    },
    ISFJ:{
        b : '딸기코코넛버블티',
        w : '모든 사람에게 친절한 당신은, 달달하면서 부드러운 딸기코코넛버블티!',
        e : '이런 타입의 사람들은 나서는 것은 별로 좋아하지 않고, 부탁받으면 거절을 잘 못하는 성격입니다. 평소에 착하고 친절하는 얘기를 주위에게서 많이 듣습니다. 잘난척 하는 사람을 싫어하고, 계획대로 일이 진행되어야 마음에 편안합니다. 다른 사람의 감정을 잘 캐치하고 공감을 잘해줍니다.'
    },
    ESFJ:{
        b : '오리지널얼그레이밀크티',
        w : '부드러우면서도 사람들에게 인기많은 당신은 언제나 사람들이 많이 찾는 오리지널얼그레이밀크티!',
        e : '이런 타입의 사람들은 타고난 분위기 메이커입니다. 보통 사회생활 잘한다는 소리를 많이 듣습니다. 새로운 사람을 만나도 쉽게 친해질 수 있고, 내 주위의 사람을 잘 챙기는 편입니다. 기본적으로 사람을 좋아하기 때문에 다른 사람들에게 인정 받는 것을 좋아합니다'
    },
    ESTJ:{
        b : '하동녹차버블티',
        w : '뭐든 확실한게 좋고 끝장을 보는 당신은 씁쓸하지만 진한 하동녹차버블티!',
        e : '이런 타입의 사람들은 고집이 세고, 호불호가 확실합니다. 친구에게는 팩트 폭행을 잘 하는 편이고, 뭐든 딱 떨어지고 확실한 게 좋습니다. 그러다보니 약속 안지키는 사람은 싫습니다. 다른 사람들에게 인정을 받는 것을 좋아하고, 상황에 차분하고 객관적으로 판단하는 장점이 있습니다. 하나 꽂히는 게 생기면 우물을 파는 편입니다.'
    },
    ISTP:{
        b : '하동녹차오레오쉐이크',
        w : '처음에는 사람들이 어려워하지만, 알고보면 단맛이 가득한 당신은 하동녹차오레오쉐이크!',
        e : '이런 타입의 사람들은 호불호가 강하고 자기 주장도 강합니다. 처음에는 낯가림이 많지만 친해지면 장난도 많이 치는 성격입니다. 가끔은 융통성 없다는 말을 듣습니다. 카톡 할 때는 할 말이 없으면 씹는 편입니다. 다른 사람에게서 간섭 받는 것이 싫고 마음에 없는 소리 하는 거 싫어합니다. 시험 공부는 벼락치기 하는 스타일입니다.'
    },
    ISFP:{
        b : '초코버블티',
        w : '만사가 귀찮은 당신은 간단하면서도 포만감이 느껴지는 초코버블티!',
        e : '이런 타입의 사람들은 만사가 귀찮습니다. 말싸움은 잘 못하는 편입니다. 사람 만나는 게 좋으면서 싫은 내가 이해되지 않습니다. 다른 사람의 부탁 거절을 똑 부러지게 잘 하는 편은 아닙니다. 틀에 박힌 환경을 오래 버티지 못하며, 자유로운 게 좋습니다.'
    },
    ESTP:{
        b : '타로버블티',
        w : '뒤끝 없는 당신은 뒤끝 없는 맛의 깔끔한 타로버블티!',
        e : '이런 타입의 사람들은 선입견이 없고 개방적인 편입니다. 따라서 무슨 일이든 뒤끝이 없습니다. 눈치가 빠르지만, 그렇다고 사람들의 눈치를 보지는 않습니다. 친구들에게 돌직구를 날리는 것을 잘합니다.'
    },
    ESFP :{
        b : '허니듀쉐이크',
        w : '어디로 튈 지 모르는 당신은 달콤하면서도 신선한 맛의 허니듀쉐이크!',
        e : '이런 타입의 사람들은 싫고 좋은 사람이 분명합니다. 또 관종끼가 있습니다. 사람들에게는 정이 많고, 내 결정에 있어서는 고집이 센 편입니다. 다만 멘탈이 약하고, 화나면 쉽게 흥분한다는 단점이 있습니다. 사교성은 보통 좋은 편입니다.'
    },
    INTJ  :{
        b : '카페라떼+펄',
        w : '진득하면서도 혼자서 척척 일을 처리하는 당신은 효율성 최고 카페라떼+펄!',
        e : '이런 타입의 사람들은 고집이 세고, 관심 분야 이외에는 관심이 없습니다. 매우 독립적입니다. 또한 감정에 휘둘리는 게 싫고, 효율성을 따집니다. 타인에게 딱히 잘보이고 싶은 마음이 없습니다. 그리고 조별 과제를 할 때에는 사람들이 협조적이지 않다면 차라리 혼자하는 게 마음 편합니다.'
    },
    INTP :{
        b : '민트초코버블티',
        w : '약간은 또라이 기질이 보이는 당신은 민트초코버블티!',
        e : '이런 타입의 사람들은 게으릅니다. 그래서 할 것을 미루고 또 미룹니다. 다른 사람에게 웬만해서는 상처를 받지 않습니다. 남한테 관심이 별로 없고, 자기 주관이 뚜렷해서 할 말은 다 하는 편입니다. 논리에 안 맞는 말을 막 하는 사람들이 이해가 되지 않습니다.'
    },
    ENTJ : {
        b : '오아시스',
        w : '쿨하고 시원시원한 당신은 상큼하고 시원한 오아시스!',
        e : '이런 타입의 사람들은 타고난 리더 스타일을 가지고 있습니다. 그래서 총대 매고 조별 과제를 끝내곤 합니다. 또한 해보지도 않고 못한다는 말을 싫어합니다. 이런 타입의 사람들은 능력 없는 사람고 고집 부리는 사람을 싫어합니다. 보통 자존감이 높습니다. 감성팔이를 나를 설득하기란 쉽지 않습니다.'
    },
    ENTP :{
        b : '사하라', 
        w : '여러 상황에 다양한 모습을 보여주는 당신은 세 가지 맛이 섞여 달콤 상큼한 사하라!',
        e : '이런 타입의 사람들은 일단 일을 저지르고 나중에 생각하는 편입니다. 임기응변에 능하기 때문에 다양한 환경에 나를 맞출 수 있습니다. 자신의 마음을 직설적으로 솔직하게 표현하는 것에 있어서 거리낌이 없습니다.'
    },
    INFJ :{
        b : '리얼초코버블티',
        w : '씁쓸하지만 알고보면 달콤한 당신은 리얼초코버블티!',
        e : '이런 타입의 사람들을 한 마디로 하자면 겉바속촉 스타일입니다. 겉으로는 무심해 보이지만 기본적으로 다정다감, 친절을 장착하고 있기 때문에 사람들에게 호감을 사는 편입니다. 상상력이 풍부합니다. 걱정도 많기 때문에 행동하기 전에 내적 갈등 많이하는 편입니다.'
    },
    INFP :{
        b : '코코넛밀크티',
        w : '감정 기복이 심한 당신은 다양한 맛이 함께 어우러지는 코코넛밀크티!',
        e : '이런 타입의 사람들은 모든 일에 의미 부여를 잘합니다. 자주 우유부단하고 게으른 모습을 보입니다. 멘탈이 엄청 약하고 감정 기복이 심하기 때문에 쿠크다스 스타일 입니다. 때로는 남들에게 관심 받고 싶지만 혼자 있는 게 좋습니다.'
    },
    ENFJ :{
        b : '초코오레오쉐이크',
        w : '모든 사람에게 최고 달달함을 보여주는 당신은 초코오레오쉐이크!',
        e : '이런 타입의 사람들은 넘치는 정의감을 가지고 있습니다. 연애할 때는 그 사람에게 백프로 헌신하는 편입니다. 모든 일에 오지랖이 심합니다. 남들에게 싫은 소리는 못하는 편이고, 보통 글을 잘 쓰거나 말을 잘합니다.'
    },
    ENFP:{
        b : '레자몽버블에이드',
        w : '다음에 어디로 튈 지 모르는 당신은 레자몽버블에이드!',
        e : '이런 타입의 사람들은 매우 긍정적이고 낙천적인 성격을 가지고 있습니다. 즉흥적으로 행동하는 편이고, 새로운 것을 좋아하기 때문에 충동구매도 매우 잘합니다. 또한 남에게 구속받는 것을 극도로 싫어합니다.'
    },
}